
#include "uart.h"
#include "stc8.h" 
//stc8-8pin 只有串口1
//串口 1 使用定时器 1（模式 0）做波特率发生器
unsigned char *pchar;				//定义一个全局指针

//----------------------------------------------------------   
//  函数名称：void IniSerialPort(void)   
//  函数功能：串口初始化   
//----------------------------------------------------------   
void InitSerialPort(void)
{ 
		SCON = 0x50; 
		TMOD = 0x00;
		TL1 = BRT; 
		TH1 = BRT >> 8;
		TR1 = 1;
		AUXR = 0x40;//0x41为使用定时器2（使用哪个定时器都不影响正常工作）

}
//----------------------------------------------------------   
//  函数名称：unsigned char ReceiveByte(void)
//  函数功能：查询法接收一个字节   
//----------------------------------------------------------   
//unsigned char ReceiveByte(void)
//{
//     unsigned char rbyte;
//     while(!RI); 					//查询接收标志位，是否有数据到达缓冲区
//     RI=0; 							//清零接收标志位
//     rbyte=SBUF; 					//从缓冲区读取数据
//     return rbyte;
//}
//----------------------------------------------------------   
//  函数名称：void SendByte(unsigned char sbyte)
//  函数功能：串口发送一个字节
//----------------------------------------------------------   
//void SendByte(unsigned char sbyte)
//{  
//     SBUF=sbyte; 					//发送数据
//     while(!TI); 					//等待发送完成
//     TI=0; 							//清零发送标志位
//}
//----------------------------------------------------------   
//  函数名称：void SendString(unsigned char *pstr)
//  函数功能：串口发送一个字符串
//----------------------------------------------------------   
//void SendString(unsigned char *pstr)
//{
//     while(*pstr!='\0') 			//字符串是否发完
//     {
//         SendByte(*pstr);			//发送字符串数据
//         pstr++; 					//指向下一个字符
//     } 
//}
//----------------------------------------------------------   
//  函数名称：void SerialPortInte(void)
//  函数功能：串口中断方式接收一个字符
//----------------------------------------------------------   
void SerialPortInte(void) interrupt 4 
{ 
     RI=0;						    //清零接收标志位
     *pchar=SBUF;					//读取缓冲区的数据
}

void putchar(char c){
    ES = 0;
    SBUF = c;
    while(TI==0);
    TI = 0;
    ES = 1;
}
/**********************************THE END**********************************/ 